<!DOCTYPE html>
<html>
       <head>

              <meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
              <title>Prosjektdagbok</title>
              <link rel="stylesheet" type="text/css" href="web1.css" title = "Web1" />

       </head>


               <body>

                      <h1><b><strong>Prosjektdagbok</strong></b></h1>

					  <h3><em>Onsdag 29.09,10</em></h3>
                      <p> I dag fikk vi vite om gruppemedlemmene v&aring;re,
                          som best&aring;r av Kristina, Vijitharan, Kristoffer og Stafeni.
                          I to m&aring;neder skal vi jobbe sammen i et prosjekt, hvor vi utvikler v&aring;r egen nettside.
                      </p>

                      <h3><em>Fredag 01.10.10</em></h3>
                      <p> Etter &aring; ha sendt mail til hverandre,
                          kom vi fram til et tidspunkt p&aring; n&aring;r og hvor vi skulle m&oslash;tes.
					      M&oslash;testedet var datatorget, hvor tre fra gruppen m&oslash;ttes.
					      I denne perioden ble vi kjent med hverandre og vi begynte sm&aring;tt &aring; diskutere om
					      hva slags nettside vi skulle utvikle og hva vi ikke skulle lage.
					      Vi kom fram til at ideen om nettbutikksiden skulle ligge p&aring; hyllen.
					      Dermed ble vi enige om at vi kunne komme med forslag til tema for nettside neste uke.
                      </p>

                      <h3><em>Mandag 04.10.10</em></h3>
                      <p> I dag var det tre fra gruppen som m&oslash;tte opp, og vi kom med ulike forslag ti tema.
                          Etter utveksling av ideer kom vi fram til &aring; lage en guideside for de eldre.
                          Etter at beslutningen var tatt, fordelte vi styringsdokumentpunktene.
					      For &aring; f&aring; mer informasjon og r&aring;d om git og ideen v&aring;r, dro vi til Simen og Siri.
					      Der vi fikk gode r&aring;d.
					      Hittil har vi blitt gode Drop box brukere, men &oslash;ver fortsatt med bruken av git.
                      </p>

                      <h3><em> Tirsdag 05.10.10 </em></h3>
                      <p> I dag ble m&oslash;tet avlyst pga. en uheldig hendelse som inntraff en i gruppen.
                          Til tross for dette, forsatte vi &aring; jobbe hver for oss selv med oppgavene v&aring;re.
                      </p>

                      <h3><em>Onsdag 06.10.10</em></h3>
                      <p> I dag var alle tilstede under m&oslash;tet.
                          I m&oslash;tet ble det tildelt samarbeidskontrakt som vi leste gjennom og underskrev p&aring;.
                      </p>

                      <h3><em>Fredag 08.10.10</em></h3>
                      <p> I dag var alle tilstede under m&oslash;tet.
                          En av gruppemedlemmene som hadde ansvaret for layouten, demonstrerte siden.
                          Etter det jobbet vi hver for oss med oppgavene.
                      </p>

                      <h3><em>Mandag  11.10.10</em></h3>
                      <p> Gruppemedlemmene jobbet hver for seg idag.
                          Vi hadde kontakten gjennom ved &aring; bruke drop box.
                          Vi er snart ferdig med leveranse 1, og imorgen skal vi m&oslash;tes og g&aring; gjennom det vi har
                          gjort hittil.
                      </p>

                      <h3><em> Tirsdag 12.10.10 </em></h3>
                      <p> I dag var alle tilstede og jobbet med leveransen i datarom 461.
                          Etter leveranse 1 har vi bestemt oss for &aring; l&aelig;re og bruke git som
                          kommunikasjonsmiddel. Hittil har vi brukt drop box. Og vi har
                          lurt p&aring; hvordan vi skal f&aring; til bruken av git, heldigvis s&aring; har Viji
                          blitt kjent med Git:)
                          Grunnen til innlevering av leveranse 1 idag er at Kristina skal reise bort. Og
                          som gruppe ble vi enige om &aring; bli ferdig med oppgaven 12. oktober.
                          Midt under arbeidet m&aring;tte vi forlate datarommet, fordi det skulle v&aelig;re datalab der.
                          S&aring; vi dro til sjette etasje for &aring; forsette med oppgaven.
                          N&aring;r vi skulle validere siden v&aring;r fikk vi en del valideringsfeil, som vi kommer
                          til &aring; ordne tilslutt.
                     </p>

                     <h3><em> Mandag 18.10.10 </em></h3>
					 <p> Dagens m&oslash;te gikk stort sett ut p&aring; &aring; dobbelsjekke leveransen v&aring;r,
					     fordi det er i dag oppgaven skal leveres.
					     To fra gruppen m&oslash;tte opp, og jobbet med hver sin oppgave.
					     I dag m&aring;tte vi fikse p&aring; aktivitetsplanen og milep&aelig;lsplanen,
					     fordi planene manglet mer beskrivelse om fremtidriften.
					     B&aring;de planene og dagboken sendte vi til Kristina,
					     siden det er hun som har ansvaret for innf&oslash;ring av dokumentene.
					     Ellers har alt godt kjempe bra, og vi gleder oss til &aring; begynne p&aring; leveranse 2 ;)
					 </p>

					  <h3><em> Fredag 22.10.10</em></h3>
					  <p> Stafeni var bortreist i dag, og vi resterende m&oslash;ttes p&aring; datatorget og snakket om leveranse 2.
					      Alle jobbet hver for seg. Kristina delte opp oppgaven i en strukturert m&aring;te slik at det var enklere &aring; lese oppgaven.
					      Kristoffer og Viji jobbet med selve nettsiden. Etter arbeidet bestilte Kristoffer gruppe rom til 28.10.10 og 04.11.10
					      slik at vi kunne jobbe aktivt uten forstyrrelser.
					  </p>


					  <h3><em> Onsdag 27.10.10</em></h3>
					  <p> Alle fra gruppen var til stede rundt klokken 09.00 p&aring; datatorget.
					      Vi snakket litt om hvor langt vi hadde kommet med hver v&aring;r oppgave.
					      Etter det tegnet vi skisser til nettsiden, og alle kom med nesten samme forslag.
					      Til slutt sammenlignet vi tegningene og tok med litt av hver enkelts ide.
					      Deretter forsatte Kristoffer og Viji med &aring; skissere ideen v&aring;r p&aring; programmet Axcer,
					      mens Kristina og Stafeni begynte med evaluering av prosjektarbeidet.
					      Underveis i arbeidet diskuterte vi v&aring;r innsats og samarbeid i prosjektet,
					      som vi skrev ned i evalueringen.  Etter en stund ble vi b&aring;de ferdig med skissen og evalueringen.
					      I dag jobbet vi ganske effektivt og gjorde en kjempe bra innsats. Og vi h&aring;per p&aring; at dette forsetter videre :)
					  </p>

					  <h3><em> Mandag 01.11.10 </em></h3>
					  <p> Gruppen skulle egentlig m&oslash;tes 28.10.10 og 29.10.10, men det ble avlyst p&aring; grunn av andre prioriteringer og sykdom.
					      I dag hadde vi treffetid i web prosjekt datalabtimen, og alle var til stede.
					      Uheldigvis var det ikke noen plass i datatorget, s&aring; vi gikk til 5 etasje for &aring; jobbe.
					      Alle fra gruppen jobbet med p&aring; &aring; finne html koden til ulike skriftst&oslash;rrelser til nettsiden.
					      Stafenis internett derimot fungerte ikke og skrev prosjektdagbok istedenfor.
					      Underveis i m&oslash;tet ble vi enige om &aring; bruke html format til midtrapporten.
					      Dagens m&oslash;te gikk bra, og i morgen skal vi m&oslash;tes igjen for &aring; oppsummere det vi har gjort hittil.
					  </p>

					 <h3><em> Tirsdag 02.11.10 </em></h3>
                    <p> I dag ble m&oslash;tet avholdt i datatorget og tre fra gruppen m&oslash;tte opp,
					    og de hadde gjort oppgavene de hadde ansvar for.  M&oslash;tet varte ikke lenge,
					    og vi avtalte om &aring; m&oslash;tes i morgen og jobbe med prosjektet fra 10.00 til 17.00 i gruppe rom PI335.
					</p>

					<h3><em> Torsdag 04.11.10 </em></h3>
					<p> I dag ble m&oslash;tet avholdt i et grupperom, og tre fra gruppen var tilstede. Uheldigvis m&oslash;tte ikke
					    Kristina opp, fordi hun har blitt innlagt i sykehus. Stafeni og Kristoffer var tilstede klokken 10 og
						jobbet med hver v&aring; r oppgave. Viji derimot dro til Furusett seniortreff for &aring; unders&oslash;ke hva de eldre synes om
						siden v&aring; r. Kommentaren var dem var at de ville ha st&oslash;rre skrift og mindre gull farge. Deretter tok han et par
						bilder av dem for &aring; legge dem i siden v&aring; r.
						I dag var m&aring; let om &aring; bli ferdig med leveranse 2, og dette greide vi &aring; fullf&oslash;re. Vi har jobbet i &aring; tte timer
						med web prosjekt med sm&aring;  pauser.
				    </p>

				    <h3><em> Mandag 08.11.10 </em></h3>
				    <p> M&oslash;tet ble avholdet i sjette etasje, og tre fra gruppen var tilstede. Kristina er forstatt syk, s&aring;
				    vi h&aring;per at hun blir frisk snart :). Selvom vi ikke er en fullstendig gruppe,s&aring; har vi kommunikasjon mellom oss.
				    Og vi h&aring;per dette forsetter videre i leveranse 3.
				    Vi har oppdatert styringssiden, og er ferdig med leveranse 2. Og gruppemedlemmene jobbet med hver sin del
				    med nettsiden seniorsurf.


				    </p>

				    <p>

				    <h3><em> Tirsdag 09.11.10 </em></h3>
					<p> I dag snakket vi om framf&oslash;ringen, som vi skal ha p&aring; torsdag. Vi diskuterte gjennom hva vi skulle ta med
					i foredraget. Etter &aring; ha plukket ut de viktigste punketene som ble problemstilling, designvalg, og skisse av nettsiden
					fordelte vi oppgavene. Stafeni tok problemstillingen, Kristoffer om skisse av nettsted og
					og Viji om designvalg. Deretter snakket vi litt hvordan foredraget skulle bygges opp, alts&aring; om vi skulle vise
					nettsiden v&aring;r eller ha en power point presentasjon. Konklusjonen ble at vi skulle se p&aring; foredragene som
					er imorgen, og vurdere ut fra det.

				    </p>


				    <h3><em> Onsdag 10.11.10 </em></h3>
                    <p> I dag var gruppen v&aring;r foredragene til de andre studentene. Vi var der og s&aring; p&aring; alle foredragene som
                    var nytiige &aring; se. Grunnen er at vi fikk ideer p&aring; hvordan vi skulle ha v&aring;r presentasjon.
                    Etter det dro vi til sjette etasje, og lagde power - point presentasjon. I l&oslash;pet av arbeidet bestemte vi
                    for &aring; ta med arbeidsverkt&oslash;y og bes&oslash;ket til seniorsenteret i foredraget. Kristina var tilstede under msn
                    og ga oss r&aring;d underveis. Etter &aring; ha blitt ferdig med PPen, framf&oslash;rte vi en og en, samtidig som vi tok tiden. Grunnen
                    er at foredraget skulle v&aelig;re i max 10 minutter.
                    Etter &aring; ha framf&oslash;rt, ble vi enige om ha programkort under presentasjonen. I tilfellet vi f&aring;r
                    jerneteppe, men det h&aring;per vi p&aring; at det ikke skjer. Etter &aring; ha gjort sm&aring; endringer p&aring; det vi skal si, framf&oslash;rte
                    vi en gang til, men denne gangen presenterte vi som en gruppe og vi fikk tid mellom 6 - 7 minutter uten avbrytelser.
                    Vi jobbet i dag ca 4 timer med foredraget, og vi gleder oss til i morgen :)
                    </p>

                    <h3><em> Torsdag 11.11.10 </em></h3>
                    <p> Vi var den f&oslash;rste gruppen som skulle framf&oslash;re, og presentasjonen gikk kjempebra :)
                    Vi fikk en del tilbakemeldinger om at vi burde tenke p&aring; fargen til forsiden, kommentarer om at vi
                    kanskje burde tenke p&aring; &aring; ta med noen bilder. Ellers var sensorene veldig forn&oslash;yde med presentasjoen
                    , de likte begrunnelsen til valgene vi hadde tatt for problemstillingen og designvalget.


				    </p>
					
					 <h3><em> Onsdag 17.11.10 </em></h3>
					 <p>
					 I dag fortsettet vi med siden v&aring;r, og begynte med sluttrapporten. Vi har opprettet google docs konto og rulerer
					 sluttrapporten, slik at alle f&aring;r bidratt med den.
					 </p>
					 
					 <h3><em> Fredag 19.11.10 </em></h3>
					 <p> Alle var tilstede, og jobbet med siden og sluttrapporten.</p>
					 
					 <h3><em> Tirsdag 23.11.10 </em></h3>
					 <p> I dag fikk vi vite at innleveringen av leveranse 3 var utsatt til 14.desember. Gruppen v&aring;r 
                     diskuterte sm&aring;tt om &aring; bli ferdig p&aring; tirsdag, grunnet av andre eksamener som dukker opp.</p>
					 
					<h3><em> Onsdag 24.11.10 </em></h3>
					<p> I dag var alle tilstede, og jobbet med nettsiden. </p>

					<h3><em> Torsdag 25.11.10 </em></h3>
					<p> I dag m&oslash;tte alle p&aring; dataorget klokken ni, for &aring; jobbe med prosjektet. Vi fikk vite at leveranse
						3 igjen hadde blitt utsatt til 17.desember. </p>
					
					<h3><em> Tirsdag 14.12.10</em></h3>
					<p> Det har nesten g&aring;tt en halv uke siden gruppen v&aring;r hadde en samlet gruppem&oslash;te. Dette p&aring; grunn av eksamener
					i andre fag. I dag hadde vi m&oslash;te kl 09.30 og jobbet ganske effektivt med leveranse 3. Vi har laget en plan hvor m&aring;let er &aring; bli ferdig
					med leveransen imorgen.
                    </p>
                      <p>
                      <a href="http://validator.w3.org/check?uri=http://www.stud.hio.no/~s171188/Hobby.html"><img
                      src="http://www.w3.org/Icons/valid-xhtml10"
		   	          alt="Valid XHTML 1.0 Strict" height="31" width="88" /></a>
                      </p>






               </body>


</html>